In [3]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [25]:
# DataFrame
data = {'state':['oh','oh','oh','Nev','Nev'],
       'year':[2000,2001,2002,2001,2002],
       'population':[1.5, 1.7, 2.3, 2.9, 3.2]}
data

{'population': [1.5, 1.7, 2.3, 2.9, 3.2],
 'state': ['oh', 'oh', 'oh', 'Nev', 'Nev'],
 'year': [2000, 2001, 2002, 2001, 2002]}

In [26]:
frame = DataFrame(data) 
frame

   population state  year
0         1.5    oh  2000
1         1.7    oh  2001
2         2.3    oh  2002
3         2.9   Nev  2001
4         3.2   Nev  2002

In [27]:
# 컬럼 순서변경 풀어보세요

   year state  population
0  2000    oh         1.5
1  2001    oh         1.7
2  2002    oh         2.3
3  2001   Nev         2.9
4  2002   Nev         3.2

In [28]:
# 인덱스 만들기 풀어보세요

In [29]:
frame2

       year state  population debt
one    2000    oh         1.5  NaN
two    2001    oh         1.7  NaN
three  2002    oh         2.3  NaN
four   2001   Nev         2.9  NaN
five   2002   Nev         3.2  NaN

In [30]:
#frame2의 컬럼값만 보여주기 풀어보세요

Index([u'year', u'state', u'population', u'debt'], dtype='object')

In [31]:
# frame2의 특정 컬럼값만 보여주기 풀어보세요

one       oh
two       oh
three     oh
four     Nev
five     Nev
Name: state, dtype: object

In [32]:
# index 'three'에 해당하는 행만 보여주기 풀어보세요

year          2002
state           oh
population     2.3
debt           NaN
Name: three, dtype: object

In [34]:
# frame2에 debt 컬럼을 추가하기 풀어보세요

frame2

       year state  population  debt
one    2000    oh         1.5    15
two    2001    oh         1.7    15
three  2002    oh         2.3    15
four   2001   Nev         2.9    15
five   2002   Nev         3.2    15

In [35]:
# np.arange(5.) 를 사용하여 debt 컬럼에 값을 추가하기 풀어보세요


frame2

       year state  population  debt
one    2000    oh         1.5     0
two    2001    oh         1.7     1
three  2002    oh         2.3     2
four   2001   Nev         2.9     3
five   2002   Nev         3.2     4

In [38]:
#frame2에 'estern' 컬럼을 추가하고,  frame2의 state가 'oh' 인지 아닌지 boolean 정보를 컬럼값으로 추가 
#풀어보세요

frame2

       year state  population  debt estern
one    2000    oh         1.5     0   True
two    2001    oh         1.7     1   True
three  2002    oh         2.3     2   True
four   2001   Nev         2.9     3  False
five   2002   Nev         3.2     4  False

In [39]:
# frame2의 'estern' 컬럼을 삭제 풀어보세요

In [40]:
frame2

       year state  population  debt
one    2000    oh         1.5     0
two    2001    oh         1.7     1
three  2002    oh         2.3     2
four   2001   Nev         2.9     3
five   2002   Nev         3.2     4